#include "main.h" 
  
 /** 
  * rot13 - encode using rot13 
  * @s: string to encode 
  * Return: encoded string 
  */ 
  
 char *rot13(char *s) 
 { 
  
         int a[53] = {'a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j', 'k', 'l', 
                         'm', 'n', 'o', 'p', 'q', 'r', 's', 't', 'u', 'v', 'w', 'x', 
                         'y', 'z', 'A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J', 
                         'K', 'L', 'M', 'N', 'O', 'P', 'Q', 'R', 'S', 'T', 'U', 'V', 
                         'W', 'X', 'Y', 'Z'}; 
         int b[53] = {'n', 'o', 'p', 'q', 'r', 's', 't', 'u', 'v', 'w', 'x', 'y', 
                         'z', 'a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j', 'k', 
                         'l', 'm', 'N', 'O', 'P', 'Q', 'R', 'S', 'T', 'U', 'V', 'W', 
                         'X', 'Y', 'Z', 'A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 
                         'J', 'K', 'L', 'M'}; 
  
         int i, j; 
  
         for (j = 0; s[j] != '\0'; j++) 
         { 
                 for (i = 0; a[i] != '\0' && s[j] != a[i]; i++) 
                         ; 
  
                 if (s[j] == a[i]) 
                         s[j] = b[i]; 
         } 
  
         return (s); 
 }
